<?php $this->layout('layout-docs') ?>

<?php $this->start('title') ?>Документация - Motor CMS<?php $this->stop() ?>
<?php $this->start('description') ?>Motor CMS - Легкий и быстрый движок для сайта. Не использует базу данных, не требует особых библиотек на сервере<?php $this->stop() ?>

<?php $this->start('header') ?>
    <h1>Документация</h1>
<?php $this->stop() ?>

<?php $this->start('breadcrumb') ?>
<nav>
    <ol class="breadcrumb">
        <li class="breadcrumb-item"><a href="/"><i class="bi bi-house-door"></i></a></li>
        <li class="breadcrumb-item active">Документация</li>
    </ol>
</nav>
<?php $this->stop() ?>

<h3>Добро пожаловать</h3>
<div class="mb-3">
MotorCMS - это система управления содержимым, которая использует файлы в качестве основного способа хранения контента. В отличие от традиционных CMS, где данные хранятся в базе данных, MotorCMS использует CSV файлы на сервере для хранения информации о страницах, постах и других элементах сайта.
</div>

<div class="mb-3">
MotorCMS состоит из набора скриптов, которые работают с файловой системой и обеспечивают удобный интерфейс для добавления, редактирования и удаления контента. Она может использоваться как для создания статических сайтов, так и для разработки динамических веб-приложений.
</div>

<div class="mb-3">
MotorCMS очень прост в использовании и настройке, поскольку не требуют установки и настройки базы данных и других сложных компонентов.<br>
Кроме того, MotorCMS работает быстрее, чем традиционные CMS, так как нет необходимости отправлять запросы к базе данных для получения данных.
</div>

<div class="mb-3">
Одним из главных преимуществ MotorCMS является её простота и легкость в использовании. Также, она не требует установки дополнительного программного обеспечения на сервере, что делает ее более экономичной в использовании.
</div>

<div class="mb-3">
MotorCMS идеально подходят для небольших сайтов или блогов, где требуется простой и быстрый способ управления контентом без лишних затрат на настройку и обслуживание базы данных.
</div>
